driver-tests/bpelse/assign/predicatesJBI/test/RepeatingNodeAssignment/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:new="http://xml.netbeans.org/schema/newXMLSchema">
  <soapenv:Body>
    <new:newElement>
      <!--1 to 5 repetitions:-->
      <new:Collection>
        <new:leafElement>1</new:leafElement>
      </new:Collection>
      <new:Collection>
        <new:leafElement>2</new:leafElement>       
      </new:Collection>
      <new:Collection>
        <new:leafElement>3</new:leafElement>
      </new:Collection>     
      <new:Collection>
        <new:leafElement>4</new:leafElement>
      </new:Collection>
      <new:Collection>
        <new:leafElement>5</new:leafElement>
      </new:Collection>      
    </new:newElement>
  </soapenv:Body>
</soapenv:Envelope>