driver-tests/bpelse/assign/predicatesJBI/test/RepeatingNodeAssignmentWithPosition/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns0="http://xml.netbeans.org/schema/newXMLSchema" xmlns="http://xml.netbeans.org/schema/newXMLSchema">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <newElement xmlns="http://xml.netbeans.org/schema/newXMLSchema">
    <ns0:Collection xmlns:ns0="http://xml.netbeans.org/schema/newXMLSchema">
      <ns0:leafElement>1</ns0:leafElement>
    </ns0:Collection>
    <ns0:Collection xmlns:ns0="http://xml.netbeans.org/schema/newXMLSchema">
      <ns0:leafElement>2</ns0:leafElement>
    </ns0:Collection>
    <ns0:Collection xmlns:ns0="http://xml.netbeans.org/schema/newXMLSchema">
      <ns0:leafElement>3</ns0:leafElement>
    </ns0:Collection>
    <ns0:Collection xmlns:ns0="http://xml.netbeans.org/schema/newXMLSchema">
      <ns0:leafElement>4</ns0:leafElement>
    </ns0:Collection>
    <ns0:Collection xmlns:ns0="http://xml.netbeans.org/schema/newXMLSchema">
      <ns0:leafElement>5</ns0:leafElement>
    </ns0:Collection>
  </newElement>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
