driver-tests/bpelse/assign/predicatesJBI/test/results/RepeatingNodeAssignment/Actual_20130221140056_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <newElement xmlns="http://xml.netbeans.org/schema/newXMLSchema" xmlns:msgns="http://j2ee.netbeans.org/wsdl/repeatingNode">
      <Collection>
        <leafElement>1</leafElement>
      </Collection>
      <Collection>
        <leafElement>2</leafElement>
      </Collection>
      <Collection>
        <leafElement>3</leafElement>
      </Collection>
      <Collection>
        <leafElement>4</leafElement>
      </Collection>
      <Collection>
        <leafElement>5</leafElement>
      </Collection>
    </newElement>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>